app/controllers/line_items_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-06-29 15:41:43.276003"], ["updated_at", "2020-06-29 15:41:43.276003"]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)

    respond_to do |format|
      if @line_item.save