app/controllers/products_controller.rb

  def index
    @products = Product.all.order(:title)
---
SELECT "products".* FROM "products" ORDER BY "products"."title" ASC