app/controllers/store_controller.rb

  def index
    if params[:set_locale]
      redirect_to store_index_url(locale: params[:set_locale])
    else
      #@products = Product.all.page(params[:page]).per(5)
      @q = Product.all.ransack params[:q]
---
SELECT "products".* FROM "products"